package com.equipment_dictionary.utils;

public class CurrentArray {
    public static void main(String[] args) {

    }
    public static String[] s1 = {"武器","防具","首饰","特殊装备"};
    public static String[][] s2 = {
            {"鬼剑士/黑暗武士/守护者","格斗家","神枪手","魔法师/缔造者","圣职者","暗夜使者","魔枪士","枪剑士"},
            {"全部职业"},{"全部职业"},{"全部职业"}
    };
    public static String[][][] s3 = {
            {
                    {"巨剑","光剑","太刀","短剑","钝器"},
                    {"拳套","爪","手套","臂铠","东方棍"},
                    {"手弩","手炮","步枪","自动手枪","左轮手枪"},
                    {"棍棒","扫把","魔杖","法杖","矛"},
                    {"战斧","镰刀","念珠","十字架","图腾"},
                    {"手杖","苦无","双剑","匕首"},
                    {"战戟","光枪","暗矛","长枪"},
                    {"重剑","源力剑","小太刀","长刀"}
            },
            {
                    {"上衣","下装","腰带","头肩","鞋子"},
            },
            {
                    {"称号","项链","手镯","戒指"},
            },
            {
                    {"辅助装备","魔法石","耳环"},
            }
    };
}
